{
  "posts": [
    {
      "body": "Flask is a lightweight Python framework for web applications that provides the basics for URL routing and page rendering. Flask is called a \"micro\" framework because it doesn't directly provide features like form validation, database abstraction, authentication, and so on. Such features are instead provided by special Python packages called Flask extensions. The extensions integrate seamlessly with Flask so that they appear as if they were part of Flask itself. For example, Flask doesn't provide a page template engine, but installing Flask includes the Jinja templating engine by default. For convenience, we typically speak of these defaults as part of Flask. In this Flask tutorial, you create a simple Flask app with three pages that use a common base template. Along the way, you experience a number of features of Visual Studio Code including using the terminal, the editor, the debugger, code snippets, and more. The completed code project for this Flask tutorial can be found on GitHub.",
      "date": "2021-12-28 T12:46",
      "id": 0,
      "image": "images/821c00c6-b4cd-4297-9265-3fdc1b4b6a04.jpeg",
      "title": "Flask"
    },
    {
      "body": "I had soo much fun this month. I visited New York, New Jersey, Maryland and Virginia. I got to go to soo many places. I saw Yetunde and Akin after 3 years, I spent time with family and i got to check places off my bucket list. New York aquarium was overrated but the sea lion show was wonderful. The museums in NYC are 👌🏽, i wish i had more time to visit museums, well, next time i guess. Big mommy took Dami and I to the museum of natural history near central park and we had quality family time(Big mommy is a very strong woman; out-walking two grown boys/men🤕 😂). Aunty Wunmi was fun too because she made me carrot cake!(I absolutely love her🤣). From uncle Tolu, I learnt how hard it was to be a software engineer and how hard i have to work to get to where i want to go(Remind him to send that killer pie or whatever that was from San Francisco). Finally, uncle Femi, my Virginia car and gist partner. I learnt a lot of things on that ride up to Virginia. Things that would help me as i try to maneuver my way in life. Special recognition goes to Uncle Kunle, aunty Debby, Papa 70 and his wife.  ",
      "date": "2021-12-28T15:17",
      "id": 1,
      "image": "images/IMG_0587.jpeg",
      "title": "December Vacay!🤩"
    }
  ]
}