{
  "posts": [
    {
      "body": "Flask is a lightweight Python framework for web applications that provides the basics for URL routing and page rendering. Flask is called a \"micro\" framework because it doesn't directly provide features like form validation, database abstraction, authentication, and so on. Such features are instead provided by special Python packages called Flask extensions. The extensions integrate seamlessly with Flask so that they appear as if they were part of Flask itself. For example, Flask doesn't provide a page template engine, but installing Flask includes the Jinja templating engine by default. For convenience, we typically speak of these defaults as part of Flask. In this Flask tutorial, you create a simple Flask app with three pages that use a common base template. Along the way, you experience a number of features of Visual Studio Code including using the terminal, the editor, the debugger, code snippets, and more. The completed code project for this Flask tutorial can be found on GitHub.",
      "date": "2021-12-28 T12:46",
      "id": 0,
      "image": "images/821c00c6-b4cd-4297-9265-3fdc1b4b6a04.jpeg",
      "title": "Flask"
    },
    {
      "body": "Cillum aliquip et dolor elit exercitation veniam ipsum labore ipsum enim officia non laboris laboris.Occaecat dolore eu mollit magna aliquip excepteur do nostrud elit ea commodo.Aute nisi sunt consequat amet.Voluptate eu ipsum non qui.Cupidatat est reprehenderit sit veniam eu nulla in aute.Ad pariatur consectetur id eu do fugiat do mollit elit mollit.Cillum voluptate esse veniam ullamco excepteur dolore commodo dolore.Incididunt quis commodo velit magna ipsum reprehenderit deserunt consectetur et tempor minim duis consectetur anim.Dolore elit consectetur irure non eu consectetur commodo est ut aliquip velit in ea.Mollit excepteur labore velit duis nostrud duis aliquip.Nostrud sit occaecat ad nisi aliquip non adipisicing irure.Exercitation exercitation culpa nulla dolore magna minim consequat sunt exercitation aliqua amet officia mollit in.Ut id aliquip ex reprehenderit sunt nisi anim aute proident anim minim elit excepteur.Eiusmod non enim pariatur non ipsum exercitation laborum sunt elit anim cillum aliquip dolore.Laboris duis reprehenderit nulla dolor qui esse aute nisi enim elit duis magna ipsum nulla.Proident anim exercitation do deserunt deserunt ea nulla labore ipsum ut.Irure tempor mollit non occaecat nulla sit.Sint sunt reprehenderit velit cillum nostrud excepteur.Veniam culpa sunt labore minim eu reprehenderit laborum aute pariatur ipsum in ad consequat magna.Excepteur reprehenderit in pariatur dolore occaecat adipisicing sunt sit enim deserunt reprehenderit.",
      "date": "2021-12-28T15:17",
      "id": 1,
      "image": "images/IMG_5058_polarr.jpeg",
      "title": "Commodo dolore qui pariatur anim nostrud voluptate quis aute voluptate!🤩"
    }
  ]
}
